InformationRegisters/МИКО_стИсторияЗвонковCDR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_стИсторияЗвонковCDR</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>calldate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>clid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>src</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dst</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>answer</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dcontext</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>channel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dstchannel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>lastapp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>lastdata</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>start</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>end</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>billsec</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>disposition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>amaflags</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>accountcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>uniqueid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>userfield</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InternalCalleridNum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>recordingfile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>origextension</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>aocs</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>aocd</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>aoce</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>aoc_costs_per_unit</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>aoc_costs_per_unit_currency</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>linkedid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>did</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cnum</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cnam</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>AcctId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>id_pbx</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МИКО_стИсторияЗвонковCEL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_стИсторияЗвонковCEL</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>eventtype</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>eventtime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cidname</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cidnum</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cidani</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cidrdnis</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ciddnid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>context</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>exten</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>channame</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>appname</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>appdata</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>amaflags</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>accountcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>uniqueid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>peer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>userdeftype</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>eventextra</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>linkedid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>userfield</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>AcctId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>id_pbx</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/МИКО_стОтладкаМодуляСтатистики/Ext/Module.bsl
&НаСервере
Процедура ВывестиРезультатыВПротоколОтладки(ТабДок) Экспорт
	ПротоколОтладки  = ПолучитьОбщийМакет("МИКО_стПротоколОтладки");
	ОбластьЗаголовок = ПротоколОтладки.Получитьобласть("Шапка");
	ТабДок.Вывести(ОбластьЗаголовок);
	
	мод_стЗагрузкаИсторииЗвонков_v7 = Вычислить("МИКО_стЗагрузкаИсторииЗвонков_v7");
	МассивАТС = мод_стЗагрузкаИсторииЗвонков_v7.ОпределитьПараметрыАТС();
	
	Индекс = 0;
	Пока Индекс < МассивАТС.Количество() Цикл
		
		// инфа об АТС
		ОбластьАТС = ПротоколОтладки.Получитьобласть("НаименованиеАТС");
		Если Индекс = 0 Тогда
		   id_pbx = ""+ МассивАТС[Индекс].Получить("id_pbx")+" (Основная АТС с адресом: "+МассивАТС[Индекс].Получить("АдресСервера")+" )"
	    Иначе
		   id_pbx = ""+ МассивАТС[Индекс].Получить("id_pbx")+" (Дополнительная АТС с адресом: "+МассивАТС[Индекс].Получить("АдресСервера")+" )"
		КонецЕсли; 
		ОбластьАТС.Параметры.id_pbx = id_pbx;
		ТабДок.Вывести(ОбластьАТС);
		
		// CDR
		ОбластьШапка = ПротоколОтладки.Получитьобласть("ТабCDR");
		ТабДок.Вывести(ОбластьШапка);
		
		ОбластьЗначениеCDR = ПротоколОтладки.Получитьобласть("ЗначТабCDR");
		ПервыйПакетДанныхCDR = ""; ПоследнийПакетДанныхCDR = "";
		ВыполнитьПроверкуСервер("CDR", МассивАТС[Индекс], ПервыйПакетДанныхCDR, ПоследнийПакетДанныхCDR);
		ОбластьЗначениеCDR.Параметры.ПервыйПакетCDR = ПервыйПакетДанныхCDR;
		ОбластьЗначениеCDR.Параметры.ПоследнийПакетCDR = ПоследнийПакетДанныхCDR;
		ТабДок.Вывести(ОбластьЗначениеCDR);
		
		ОбластьПробел = ПротоколОтладки.Получитьобласть("Пробел");
		ТабДок.Вывести(ОбластьПробел);
		
		// CEL
		ОбластьШапка = ПротоколОтладки.Получитьобласть("ТабCEL");
		ТабДок.Вывести(ОбластьШапка);

		ОбластьЗначениеCEL = ПротоколОтладки.Получитьобласть("ЗначТабCEL");
		ПервыйПакетДанныхCEL = ""; ПоследнийПакетДанныхCEL = "";
		ВыполнитьПроверкуСервер("CEL",  МассивАТС[Индекс], ПервыйПакетДанныхCEL, ПоследнийПакетДанныхCEL);
		ОбластьЗначениеCEL.Параметры.ПервыйПакетCEL = ПервыйПакетДанныхCEL;
		ОбластьЗначениеCEL.Параметры.ПоследнийПакетCEL = ПоследнийПакетДанныхCEL;
		ТабДок.Вывести(ОбластьЗначениеCEL);
		
		ТабДок.Вывести(ОбластьПробел);

		// выводим проверочную ссылку
		ХостAsterisk = МассивАТС[Индекс].Получить("АдресСервера"); 
		ПортСервера  = МассивАТС[Индекс].Получить("ПортСервера"); 
		Ресурс       = МассивАТС[Индекс].Получить("РесурсCDR");
		ОбластьСправка = ПротоколОтладки.Получитьобласть("Справка");
		ОбластьСправка.Параметры.ПроверочнаяСсылка = "http://"+ХостAsterisk+":"+ПортСервера+Ресурс+"?limit=450&offset=0";
		ТабДок.Вывести(ОбластьСправка);
		
		// выводим результат CDR из браузера
		ОбластьПроверочнаяСсылка = ПротоколОтладки.Получитьобласть("ПроверочнаяСсылка");
		limit=20;
		Ресурс = ПолучитьРесурсCDR(limit,,МассивАТС[Индекс].Получить("id_pbx"), МассивАТС[Индекс].Получить("РесурсCDR"));
		РезультатКлиент = ОтправитьДляОбработкиНаАТС(Ресурс, Истина, МассивАТС[Индекс]);
		ОбластьПроверочнаяСсылка.Параметры.РезультатКлиентCDR = РезультатКлиент;
		Ресурс = СтрЗаменить(Ресурс, "&offset=", Символы.ПС);
		Ресурс = СтрЗаменить(Ресурс, "limit=", Символы.ПС);         
		ОбластьПроверочнаяСсылка.Параметры.offsetCDR = СтрПолучитьСтроку(Ресурс,3);
		ОбластьПроверочнаяСсылка.Параметры.limitCDR = СтрПолучитьСтроку(Ресурс,2);
		
		// выводим результат CEL из браузера
		Ресурс = ПолучитьРесурсCEL(limit,,МассивАТС[Индекс].Получить("id_pbx"),МассивАТС[Индекс].Получить("РесурсCEL"));
		РезультатКлиент = ОтправитьДляОбработкиНаАТС(Ресурс, Истина, МассивАТС[Индекс]);
		ОбластьПроверочнаяСсылка.Параметры.РезультатКлиентCEL = РезультатКлиент;
		Ресурс = СтрЗаменить(Ресурс, "&offset=", Символы.ПС);
		Ресурс = СтрЗаменить(Ресурс, "limit=", Символы.ПС);         
		ОбластьПроверочнаяСсылка.Параметры.offsetCEL = СтрПолучитьСтроку(Ресурс,3);
		ОбластьПроверочнаяСсылка.Параметры.limitCEL = СтрПолучитьСтроку(Ресурс,2);
		ТабДок.Вывести(ОбластьПроверочнаяСсылка);
		
		Индекс = Индекс + 1;
	КонецЦикла;	

КонецПроцедуры // ()

&НаСервере
Процедура ВыполнитьПроверкуСервер(ТипПроверки = "CDR", ПараметрыАТС, ПервыйПакетДанных, ПоследнийПакетДанных)
	
	ПервыеЗаписиПрисутствуют 	= Ложь;
	ПоследниеЗаписиПрисутствуют = Ложь;
	ПоследниеДанныеПолучены 	= Истина;
	ПервыеДанныеПолучены 		= Истина;
	ОписаниеОшибкиПервый 		= "";
	ОписаниеОшибкиПоследний		= "";
	
	ПервыеЗаписи         = "";
	ПоследниеЗаписи      = "";
	
	// Получим первые записи истории звонков с АТС.	
	Ресурс = Вычислить("ПолучитьРесурс"+ТипПроверки+"(1,0,"+ПараметрыАТС.Получить("id_pbx")+","+""""+ПараметрыАТС.Получить("Ресурс"+ТипПроверки+"")+""""+")");	
   	ДокументDOM_Первый = ОтправитьДляОбработкиНаАТС(Ресурс,,ПараметрыАТС,,ОписаниеОшибкиПервый);
	
	Если Найти(ДокументDOM_Первый, "Ошибка подключения к АТС")>0 Тогда
		Сообщить(ДокументDOM_Первый);
		Возврат;
	КонецЕсли; 
	
	ДанныеСтроки = РазобратьОтветСервераCDR_CEL(ДокументDOM_Первый, ТипПроверки);
	Если ЗначениеЗаполнено(ДанныеСтроки.AcctId) Тогда
		ПервыеЗаписиПрисутствуют = ПроверитьНаличиеЗаписиВРегистре(ДанныеСтроки, ТипПроверки, ПараметрыАТС.Получить("id_pbx"));
		
		Если ПервыеЗаписиПрисутствуют Тогда
			Если ТипПроверки = "CDR" Тогда	
				ПервыеЗаписи = "Первые данные совпадают: 
				 | ActId = "+ДанныеСтроки.AcctId+"
				 | Start = "+ДанныеСтроки.Start+"
				 | End = "+ДанныеСтроки.End+"";
			 Иначе
				 ПервыеЗаписи = "Первые данные совпадают: 
				 | ActId = "+ДанныеСтроки.AcctId+"
				 | eventtime = "+ДанныеСтроки.eventtime+"";
			
			 КонецЕсли; 
		Иначе
			 Если ТипПроверки = "CDR" Тогда	
				ПервыеЗаписи = ""+ Символы.ПС + "Первые данные проверочной ссылки: 
				 | ActId = "+ДанныеСтроки.AcctId+"
				 | Start = "+ДанныеСтроки.Start+"
				 | End = "+ДанныеСтроки.End+"";
				 
				ПерваяЗаписьВРегистре = ПолучитьПакетРегистраСведений(0,ТипПроверки, ПараметрыАТС.Получить("id_pbx"));
				ПерваяЗаписьВРегистре = СтрЗаменить(ПерваяЗаписьВРегистре,"@", Символы.ПС);
				
				ПервыеЗаписи = ПервыеЗаписи + Символы.ПС + "Первые данные регистра сведений: 
				 | ActId    = "+СтрПолучитьСтроку(ПерваяЗаписьВРегистре,1)+"
				 | UID      = "+СтрПолучитьСтроку(ПерваяЗаписьВРегистре,2)+"
				 | Start    = "+СтрПолучитьСтроку(ПерваяЗаписьВРегистре,3)+"
				 | End      = "+СтрПолучитьСтроку(ПерваяЗаписьВРегистре,4)+"
				 | linkedid = "+СтрПолучитьСтроку(ПерваяЗаписьВРегистре,5)+"";
				 
			 Иначе
				 ПервыеЗаписи = ""+ Символы.ПС +"Первые данные проверочной ссылки: 
				 | ActId     = "+ДанныеСтроки.AcctId+"
				 | eventtime = "+ДанныеСтроки.eventtime+"";
				 
				ПерваяЗаписьВРегистре = ПолучитьПакетРегистраСведений(0,ТипПроверки, ПараметрыАТС.Получить("id_pbx"));
				ПерваяЗаписьВРегистре = СтрЗаменить(ПерваяЗаписьВРегистре,"@", Символы.ПС);
				
				ПервыеЗаписи = ПервыеЗаписи + Символы.ПС +"Первые данные регистра сведений: 
				 | ActId     = "+СтрПолучитьСтроку(ПерваяЗаписьВРегистре,1)+"
				 | UID       = "+СтрПолучитьСтроку(ПерваяЗаписьВРегистре,2)+"
				 | eventtime = "+СтрПолучитьСтроку(ПерваяЗаписьВРегистре,3)+"";
			
			 КонецЕсли; 		
		КонецЕсли; 

	Иначе
		ПервыеДанныеПолучены 	= Ложь;
	КонецЕсли; 	
	
	// Получим последние записи истории звонков с АТС.
	Ресурс = Вычислить("ПолучитьРесурс"+ТипПроверки+"(10, Неопределено, "+ПараметрыАТС.Получить("id_pbx")+","+""""+ПараметрыАТС.Получить("Ресурс"+ТипПроверки+"")+""""+",-1)");	
   	ДокументDOM = ОтправитьДляОбработкиНаАТС(Ресурс,,ПараметрыАТС,, ОписаниеОшибкиПоследний);
	ДанныеСтроки = РазобратьОтветСервераCDR_CEL(ДокументDOM, ТипПроверки);
	Если ЗначениеЗаполнено(ДанныеСтроки.AcctId) Тогда
		ПоследниеЗаписиПрисутствуют = ПроверитьНаличиеЗаписиВРегистре(ДанныеСтроки, ТипПроверки, ПараметрыАТС.Получить("id_pbx"));	
		
		Если ПоследниеЗаписиПрисутствуют Тогда
			Если ТипПроверки = "CDR" Тогда	
				ПоследниеЗаписи = "Последние данные совпадают: 
				 | ActId = "+ДанныеСтроки.AcctId+"
				 | Start = "+ДанныеСтроки.Start+"
				 | End = "+ДанныеСтроки.End+"";
			 Иначе
				 ПоследниеЗаписи = "Последние данные совпадают: 
				 | ActId = "+ДанныеСтроки.AcctId+"
				 | eventtime = "+ДанныеСтроки.eventtime+"";
			
			 КонецЕсли; 
		Иначе
			 Если ТипПроверки = "CDR" Тогда	
				ПоследниеЗаписи = ""+ Символы.ПС +"Последние данные проверочной ссылки: 
				 | ActId = "+ДанныеСтроки.AcctId+"
				 | Start = "+ДанныеСтроки.Start+"
				 | End = "+ДанныеСтроки.End+"";
				 
				ПоследняяЗаписьВРегистре = ПолучитьПакетРегистраСведений(1,ТипПроверки, ПараметрыАТС.Получить("id_pbx"));
				ПоследняяЗаписьВРегистре = СтрЗаменить(ПоследняяЗаписьВРегистре,"@", Символы.ПС);
				
				ПоследниеЗаписи = ПоследниеЗаписи + Символы.ПС + "Последние данные регистра сведений: 
				 | ActId    = "+СтрПолучитьСтроку(ПоследняяЗаписьВРегистре,1)+"
				 | UID      = "+СтрПолучитьСтроку(ПоследняяЗаписьВРегистре,2)+"
				 | Start    = "+СтрПолучитьСтроку(ПоследняяЗаписьВРегистре,3)+"
				 | End      = "+СтрПолучитьСтроку(ПоследняяЗаписьВРегистре,4)+"
				 | linkedid = "+СтрПолучитьСтроку(ПоследняяЗаписьВРегистре,5)+"";
				 
			 Иначе
				 ПоследниеЗаписи = ""+ Символы.ПС + "Последние данные проверочной ссылки: 
				 | ActId     = "+ДанныеСтроки.AcctId+"
				 | eventtime = "+ДанныеСтроки.eventtime+"";
				 
				ПоследняяЗаписьВРегистре = ПолучитьПакетРегистраСведений(1,ТипПроверки, ПараметрыАТС.Получить("id_pbx"));
				ПоследняяЗаписьВРегистре = СтрЗаменить(ПоследняяЗаписьВРегистре,"@", Символы.ПС);
				
				ПоследниеЗаписи = ПоследниеЗаписи + Символы.ПС + "Последние данные регистра сведений: 
				 | ActId     = "+СтрПолучитьСтроку(ПоследняяЗаписьВРегистре,1)+"
				 | UID       = "+СтрПолучитьСтроку(ПоследняяЗаписьВРегистре,2)+"
				 | eventtime = "+СтрПолучитьСтроку(ПоследняяЗаписьВРегистре,3)+"";
			
			 КонецЕсли; 		
		КонецЕсли; 
					
	Иначе
		ПоследниеДанныеПолучены 	= Ложь;
	КонецЕсли;
	
	
	Если ПервыеЗаписиПрисутствуют Тогда
		ПервыйПакетДанных = "Ошибок не обнаружено. История успешно загружается. " + ПервыеЗаписи;
	Иначе
		Если ПоследниеЗаписиПрисутствуют = Истина Тогда
			// Ранее была начата загрузка с начала.
			ПервыйПакетДанных = "Ошибок не обнаружено. История"+ ТипПроверки +" успешно загружается. "+ ПервыеЗаписи;
		Иначе
			// Вероятно следует начать загрузку данных с начала
			ПервыйПакетДанных = "История по "+ ТипПроверки +" НЕ совпадает. Первые записи не совпадают. "+ ПервыеЗаписи;
		КонецЕсли;
	КонецЕсли;
	
	Если ПервыеДанныеПолучены = Ложь Тогда
		// Проблемы с доступом к АТС.
		ПервыйПакетДанных = "Данные с АТС НЕ получены. Проблемы с доступом к АТС. Описание ошибки: " + ОписаниеОшибкиПервый;
	КонецЕсли;	
	
	Если ПоследниеЗаписиПрисутствуют Тогда
		ПоследнийПакетДанных = "Ошибок не обнаружено. История успешно загружается. " + ПоследниеЗаписи;
	Иначе
		ПоследнийПакетДанных = "История по "+ ТипПроверки +" НЕ совпадает. Последние записи не совпадают. "+ ПоследниеЗаписи;
	КонецЕсли;
	
	Если ПоследниеДанныеПолучены = Ложь Тогда
		// Проблемы с доступом к АТС.               
		ПоследнийПакетДанных = "Данные с АТС НЕ получены. Проблемы с достпом к АТС. Описание ошибки: " + ОписаниеОшибкиПоследний;
	КонецЕсли;
	
	
КонецПроцедуры // ВыполнитьПроверкуСервер()
 
&НаСервере
// ИндексПакета = 0 - первый пакет, ина че последний пакет
Функция ПолучитьПакетРегистраСведений(ИндексПакета, ТипПроверки = "CDR", id_pbx)
	
	Запрос = Новый Запрос;
	Если ТипПроверки = "CDR" Тогда					   
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	МИКО_ИсторияЗвонков.AcctId КАК AcctId
		               |ПОМЕСТИТЬ МаксAcctId
		               |ИЗ
		               |	РегистрСведений.МИКО_стИсторияЗвонковCDR КАК МИКО_ИсторияЗвонков
		               |ГДЕ
		               |	МИКО_ИсторияЗвонков.AcctId > 0
		               |	И МИКО_ИсторияЗвонков.id_pbx = &id_pbx
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	МИКО_ИсторияЗвонков.calldate УБЫВ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 1
		               |	МИКО_ИсторияЗвонков.AcctId КАК AcctId
		               |ПОМЕСТИТЬ МинAcctId
		               |ИЗ
		               |	РегистрСведений.МИКО_стИсторияЗвонковCDR КАК МИКО_ИсторияЗвонков
		               |ГДЕ
		               |	МИКО_ИсторияЗвонков.AcctId > 0
		               |	И МИКО_ИсторияЗвонков.id_pbx = &id_pbx
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	МИКО_ИсторияЗвонков.calldate
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МИКО_стИсторияЗвонковCDR.UID,
		               |	МИКО_стИсторияЗвонковCDR.start,
		               |	МИКО_стИсторияЗвонковCDR.end,
		               |	МИКО_стИсторияЗвонковCDR.linkedid,
		               |	МаксAcctId.AcctId КАК МаксAcctId,
		               |	МинAcctId.AcctId КАК МинAcctId,
		               |	МИКО_стИсторияЗвонковCDR.AcctId
		               |ИЗ
		               |	РегистрСведений.МИКО_стИсторияЗвонковCDR КАК МИКО_стИсторияЗвонковCDR
		               |		ЛЕВОЕ СОЕДИНЕНИЕ МаксAcctId КАК МаксAcctId
		               |		ПО (ИСТИНА),
		               |	МинAcctId КАК МинAcctId
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА &ИндексПакета = 0
		               |				ТОГДА МИКО_стИсторияЗвонковCDR.AcctId = МинAcctId.AcctId
		               |			ИНАЧЕ МИКО_стИсторияЗвонковCDR.AcctId = МаксAcctId.AcctId
		               |		КОНЕЦ
		               |	И МИКО_стИсторияЗвонковCDR.id_pbx = &id_pbx";

		Запрос.УстановитьПараметр("id_pbx", id_pbx);
		Запрос.УстановитьПараметр("ИндексПакета", ИндексПакета);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПакетРегистраСведений = ""+Выборка.AcctId+"@"+Выборка.UID+"@"+Выборка.start+"@"+Выборка.end+"@"+Выборка.linkedid;
		КонецЦикла; 
	Иначе	
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	МИКО_ИсторияЗвонков.AcctId КАК AcctId
		               |ПОМЕСТИТЬ МаксAcctId
		               |ИЗ
		               |	РегистрСведений.МИКО_стИсторияЗвонковCEL КАК МИКО_ИсторияЗвонков
		               |ГДЕ
		               |	МИКО_ИсторияЗвонков.AcctId > 0
		               |	И МИКО_ИсторияЗвонков.id_pbx = &id_pbx
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	МИКО_ИсторияЗвонков.eventtime УБЫВ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 1
		               |	МИКО_ИсторияЗвонков.AcctId КАК AcctId
		               |ПОМЕСТИТЬ МинAcctId
		               |ИЗ
		               |	РегистрСведений.МИКО_стИсторияЗвонковCEL КАК МИКО_ИсторияЗвонков
		               |ГДЕ
		               |	МИКО_ИсторияЗвонков.AcctId > 0
		               |	И МИКО_ИсторияЗвонков.id_pbx = &id_pbx
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	МИКО_ИсторияЗвонков.eventtime
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МИКО_стИсторияЗвонковCEL.UID,
		               |	МИКО_стИсторияЗвонковCEL.eventtime,
		               |	МаксAcctId.AcctId КАК МаксAcctId,
		               |	МинAcctId.AcctId КАК МинAcctId,
		               |	МИКО_стИсторияЗвонковCEL.AcctId
		               |ИЗ
		               |	РегистрСведений.МИКО_стИсторияЗвонковCEL КАК МИКО_стИсторияЗвонковCEL
		               |		ЛЕВОЕ СОЕДИНЕНИЕ МаксAcctId КАК МаксAcctId
		               |		ПО (ИСТИНА),
		               |	МинAcctId КАК МинAcctId
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА &ИндексПакета = 0
		               |				ТОГДА МИКО_стИсторияЗвонковCEL.AcctId = МинAcctId.AcctId
		               |			ИНАЧЕ МИКО_стИсторияЗвонковCEL.AcctId = МаксAcctId.AcctId
		               |		КОНЕЦ
		               |	И МИКО_стИсторияЗвонковCEL.id_pbx = &id_pbx";

		Запрос.УстановитьПараметр("id_pbx", id_pbx);			   
		Запрос.УстановитьПараметр("ИндексПакета", ИндексПакета);
	    Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПакетРегистраСведений = ""+Выборка.AcctId+"@"+Выборка.UID+"@"+Выборка.eventtime;
		КонецЦикла;
	КонецЕсли; 
	
	Возврат ПакетРегистраСведений;

КонецФункции // ПолучитьПакетРегистраСведений()

&НаСервере
Функция ПроверитьНаличиеЗаписиВРегистре(ДанныеСтроки, ТипПроверки = "CDR", id_pbx)

	Запрос = Новый Запрос;
	Если ТипПроверки = "CDR" Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	МИКО_ИсторияЗвонков.AcctId КАК AcctId
		               |ИЗ
		               |	РегистрСведений.МИКО_стИсторияЗвонковCDR КАК МИКО_ИсторияЗвонков
		               |ГДЕ
		               |	МИКО_ИсторияЗвонков.AcctId > 0
		               |	И МИКО_ИсторияЗвонков.AcctId = &acctid
		               |	И МИКО_ИсторияЗвонков.start = &start
		               |	И МИКО_ИсторияЗвонков.end = &end
		               |	И МИКО_ИсторияЗвонков.id_pbx = &id_pbx
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	AcctId";
		Запрос.УстановитьПараметр("acctid", Число(ДанныеСтроки.AcctId));	
		Запрос.УстановитьПараметр("start", 	ДанныеСтроки.start);	
		Запрос.УстановитьПараметр("end", 	ДанныеСтроки.end);	
		Запрос.УстановитьПараметр("id_pbx", id_pbx);	
		
	Иначе	
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	МИКО_ИсторияЗвонков.AcctId КАК AcctId
		               |ИЗ
		               |	РегистрСведений.МИКО_стИсторияЗвонковCEL КАК МИКО_ИсторияЗвонков
		               |ГДЕ
		               |	МИКО_ИсторияЗвонков.AcctId > 0
		               |	И МИКО_ИсторияЗвонков.AcctId = &acctid
		               |	И МИКО_ИсторияЗвонков.eventtime = &eventtime
		               |	И МИКО_ИсторияЗвонков.id_pbx = &id_pbx
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	AcctId";
		Запрос.УстановитьПараметр("acctid", Число(ДанныеСтроки.AcctId));	
		Запрос.УстановитьПараметр("eventtime", 	ДанныеСтроки.eventtime);
		Запрос.УстановитьПараметр("id_pbx", id_pbx);
	КонецЕсли; 
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции // ПроверитьНаличиеЗаписиВРегистре()
 
// Синхронизация таблицы CDR.
// 
Функция ПолучитьРесурсCDR(limit=450, offset=Неопределено, id_pbx, РесурсCDR, Сдвиг=0)
	
	Если НЕ ТипЗнч(offset) = Тип("Число") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	МИКО_ИсторияЗвонков.AcctId КАК AcctId
		               |ИЗ
		               |	РегистрСведений.МИКО_стИсторияЗвонковCDR КАК МИКО_ИсторияЗвонков
		               |ГДЕ
		               |	МИКО_ИсторияЗвонков.AcctId > 0
		               |	И МИКО_ИсторияЗвонков.id_pbx = &id_pbx
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	AcctId УБЫВ";
		
		Запрос.УстановитьПараметр("id_pbx", id_pbx);			   
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ПоследнийПолученныйПакет = Выборка.AcctId;
		КонецЕсли;
		ПоследнийПолученныйПакет = ?(ЗначениеЗаполнено(ПоследнийПолученныйПакет),ПоследнийПолученныйПакет + Сдвиг,0); 
	Иначе
		ПоследнийПолученныйПакет = offset;
	КонецЕсли; 
	
	РесурсНаСервере=""+РесурсCDR+"?limit="+limit+"&offset="+Формат(ПоследнийПолученныйПакет,"ЧН=0; ЧГ=");
	
	Возврат РесурсНаСервере;
	
КонецФункции

// Синхронизация таблицы CDR.
// 
Функция ПолучитьРесурсCEL(limit=450, offset=Неопределено, id_pbx, РесурсCEL, Сдвиг=0)
	Если НЕ ТипЗнч(offset) = Тип("Число") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	МИКО_ИсторияЗвонков.AcctId КАК AcctId
		               |ИЗ
		               |	РегистрСведений.МИКО_стИсторияЗвонковCEL КАК МИКО_ИсторияЗвонков
		               |ГДЕ
		               |	МИКО_ИсторияЗвонков.AcctId > 0
		               |	И МИКО_ИсторияЗвонков.id_pbx = &id_pbx
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	AcctId УБЫВ";
		
		Запрос.УстановитьПараметр("id_pbx", id_pbx);				   
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ПоследнийПолученныйПакет = Выборка.AcctId;
		КонецЕсли;
		ПоследнийПолученныйПакет = ?(ЗначениеЗаполнено(ПоследнийПолученныйПакет),ПоследнийПолученныйПакет + Сдвиг,0);  
	Иначе
		ПоследнийПолученныйПакет = offset;
	КонецЕсли; 
	
	РесурсНаСервере=""+РесурсCEL+"?&limit="+limit+"&offset="+Формат(ПоследнийПолученныйПакет,"ЧН=0; ЧГ=") + "&";	
	
	Возврат РесурсНаСервере;
КонецФункции

// Отправка запроса на сервер, получение ответа
//
// ХостAsterisk = "sip.asterisk.ru"; 
// ПортСервера = 23600;
// ПользовательСтатистики = "statistic"; 
// ПарольПользователяСтатистики = "863****6";
Функция ОтправитьДляОбработкиНаАТС(РесурсНаСервере, КакТекст=Ложь, ПараметрыАТС, ПортСервера=0, ОписаниеОшибкиПоследний="")
	ДокументDOM = Неопределено;
	
	Если ПараметрыАТС = Неопределено Тогда
		ХостAsterisk 				= ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.АдресСервера(); 
		ПортСервера 				= ?(ПортСервера=0, ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПортСервера(), ПортСервера);
		ПользовательСтатистики 		= ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПользовательСтатистики(); 
		ПарольПользователяСтатистики= ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.Пароль();
		Таймаут 					= ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ВремяОжиданияОтвета();
	Иначе
		ХостAsterisk 				= ПараметрыАТС.Получить("АдресСервера"); 
		ПортСервера 				= ?(ПортСервера=0, ПараметрыАТС.Получить("ПортСервера"), ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПортСервера());
		ПользовательСтатистики 		= ПараметрыАТС.Получить("Логин");
		ПарольПользователяСтатистики= ПараметрыАТС.Получить("Пароль");
		Таймаут 					= ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ВремяОжиданияОтвета();
	КонецЕсли; 
	
	Попытка
		HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
		HTTP = Новый HTTPСоединение(ХостAsterisk,ПортСервера,ПользовательСтатистики,ПарольПользователяСтатистики,,Таймаут);
		ОтветСервера = HTTP.Получить(HTTPЗапрос);
	Исключение
		ОписаниеОшибкиПоследний = "Ошибка подключения к АТС. Нет доступа" + ОписаниеОшибки();
		Возврат ОписаниеОшибкиПоследний;
	КонецПопытки; 	
	
	Если ОтветСервера.КодСостояния = 302 Тогда
	// Это переадресация на другой ресурс, чаще на https.
		Location 	= ОтветСервера.Заголовки.Получить("Location");
		врДанныеURL = МИКО_стОбщегоНазначения.мвРазложитьСтрокуВМассив(Location, "/");
		Если врДанныеURL.Количество()>=2 Тогда
			врСокет    	   = МИКО_стОбщегоНазначения.мвРазложитьСтрокуВМассив(врДанныеURL[1], ":");
			врХостAsterisk = ?(врСокет.Количество()>0,врСокет[0], ХостAsterisk);
			
			ПортПоУмолчанию = 80;
			ЗащищенноеСоединение= Неопределено;
			Если Найти(НРег(врДанныеURL[0]), "http:")=0 Тогда
			 	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
				ПортПоУмолчанию = 443;
			КонецЕсли; 
			врПортСервера  = ?(врСокет.Количество()>1,врСокет[1], ПортПоУмолчанию);
			
			// Вычисляем ресурс
			врАдресСервера = Прав(Location, СтрДлина(Location) - (Найти(Location, врДанныеURL[1]) + СтрДлина(врДанныеURL[1]) - 1) );
			
			Попытка
				HTTP = Новый HTTPСоединение(врХостAsterisk, врПортСервера,ПользовательСтатистики,ПарольПользователяСтатистики,,Таймаут, ЗащищенноеСоединение);
				HTTPЗапрос = Новый HTTPЗапрос(врАдресСервера);
				ОтветСервера = HTTP.Получить(HTTPЗапрос);
			Исключение
				ОписаниеОшибкиПоследний = "Ошибка подключения к АТС. Нет доступа" + ОписаниеОшибки();
				Возврат ОписаниеОшибкиПоследний;
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ОтветСервера.КодСостояния = 200 Тогда
		СообщениеHTTP = "Ошибка подключения к АТС: """ + ХостAsterisk + """. "+ Символы.ПС +
						"Код состояния HTTP " + Формат(ОтветСервера.КодСостояния, "ЧРГ=; ЧН=0; ЧГ=")+".";
		ОписаниеОшибкиПоследний = СообщениеHTTP;				
		Возврат СообщениеHTTP;
	КонецЕсли; 
	
	ТекстДокумента = ОтветСервера.ПолучитьТелоКакСтроку();
	Если КакТекст=Истина Тогда
	 	Возврат ТекстДокумента;
	КонецЕсли; 	
	// 3. Разбор ответа
	ЧтениеHTML 	 	= Новый ЧтениеHTML;	
	ПостроительDOM 	= Новый ПостроительDOM; 
	ЧтениеHTML.УстановитьСтроку(ТекстДокумента);
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеHTML);
	
	Возврат ДокументDOM;
КонецФункции

&НаСервере
Функция РазобратьОтветСервераCDR_CEL(ДокументDOM, ТипПроверки = "CDR")

	ScrptCtrl = Неопределено; Это83 = Неопределено;
	Если ТипПроверки = "CDR" Тогда
		ДанныеСтроки = Новый Структура("acctid,start,end");
		СтрокаОтвета = ДокументDOM.ПолучитьЭлементыПоИмени("cdr-row");
		Для каждого СтрокаCDR  Из СтрокаОтвета Цикл
			
			Для каждого Атрибут Из СтрокаCDR.Атрибуты Цикл
			
				Параметр = НРег(Атрибут.Имя);                     
				Значение = Атрибут.Значение;
				
				Значение = МИКО_стСлужебный.URLDecode(Атрибут.Значение, ScrptCtrl, Это83);
				Если Параметр="id" ИЛИ Параметр="acctid" Тогда
					Параметр = "acctid";
					ДанныеСтроки["acctid"] = Значение;
				КонецЕсли;
				
				Если Параметр="end" ИЛИ Параметр="start" Тогда
					Значение = МИКО_опЗаписьКИ.ПреобразоватьВДату(Значение);
					ДанныеСтроки[Параметр] = Значение;
				КонецЕсли;

			КонецЦикла; 

		КонецЦикла;
	Иначе
		ДанныеСтроки = Новый Структура("acctid,eventtime");
		СтрокаОтвета = ДокументDOM.ПолучитьЭлементыПоИмени("cel-row");
		Для каждого СтрокаCDR  Из СтрокаОтвета Цикл
			
			Для каждого Атрибут Из СтрокаCDR.Атрибуты Цикл
			
				Параметр = НРег(Атрибут.Имя);                     
				Значение = Атрибут.Значение;
				
				Значение = МИКО_стСлужебный.URLDecode(Атрибут.Значение, ScrptCtrl, Это83);
				Если Параметр="id" ИЛИ Параметр="acctid" Тогда
					Параметр = "acctid";
					ДанныеСтроки["acctid"] = Значение;
				КонецЕсли;
				
				Если Параметр="eventtime" Тогда
					Значение = МИКО_опЗаписьКИ.ПреобразоватьВДату(Значение);
					ДанныеСтроки[Параметр] = Значение;
				КонецЕсли;

			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли; 
	
    Возврат ДанныеСтроки;
КонецФункции // РазобратьОтветСервераCDR()
